4Alisa/11/Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

4Alisa/11/AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

4Alisa/11/Documents/Списание/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ВернутьТекстЗапросаПоТоварам()
	Возврат "ВЫБРАТЬ
	        |	ОстаткиТоваровОстатки.Товар КАК Товар,
	        |	ОстаткиТоваровОстатки.СрокГодности КАК СрокГодности,
	        |	СУММА(ОстаткиТоваровОстатки.КоличествоОстаток) КАК Количество
	        |ИЗ
	        |	РегистрНакопления.ОстаткиТоваров.Остатки(&ДатаСреза, СрокГодности <= &ДатаСреза) КАК ОстаткиТоваровОстатки
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ОстаткиТоваровОстатки.Товар,
	        |	ОстаткиТоваровОстатки.СрокГодности";
КонецФункции

&НаСервере
Процедура ЗаполнитьИстекшимиНаСервере()
	// Вставить содержимое обработчика.	
	СписокТоваров = ЭтотОбъект.Объект.СписокТоваров;	
	СписокТоваров.Очистить();
	ТекстЗапроса = ВернутьТекстЗапросаПоТоварам();
	Запрос = Новый Запрос(ТекстЗапроса);
	ДатаСреза = ЭтотОбъект.Объект.Дата;
	//СрокГодности = ДатаСреза - 
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	//Запрос.УстановитьПараметр("СрокГодности", СрокГодности);
	РЗапроса = Запрос.Выполнить(); 
	ВЗапроса = РЗапроса.Выбрать();	
	
	Пока ВЗапроса.Следующий() Цикл
		СтрокаСписания = СписокТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписания, ВЗапроса);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИстекшими(Команда)	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьИстекшимиЗавершение", ЭтотОбъект), "Перед заполнением табличная часть документа будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Заполнение табчасти", КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИстекшимиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИстекшимиНаСервере();
	
КонецПроцедуры
